Repository: ahmed-shorbagy/wassly
Catalog: lib/l10n/app_*.arb
Languages: ar

# cleaningAndLaundry
source: Cleaning & Laundry
ar: التنظيف والغسيل

source: Special Diet
ar: نظام غذائي خاص

# spicesAndSauces
source: Spices & Sauces
ar: التوابل والصلصات

source: Shop by Category
ar: تسوق حسب الفئة

# mostSoldProducts
source: Most Sold
ar: الأكثر مبيعاً

source: Promotional Images
ar: الصور الترويجية

source: Add Promotional Image
ar: إضافة صورة ترويجية

source: Edit Promotional Image
ar: تعديل صورة ترويجية

source: Delete Promotional Image
ar: حذف صورة ترويجية

# areYouSureDeletePromotionalImage
source: Are you sure you want to delete the promotional image
ar: هل أنت متأكد من حذف الصورة الترويجية

source: Promotional Image
ar: صورة ترويجية

source: No Promotional Images
ar: لا توجد صور ترويجية

source: Start by adding your first promotional image
ar: ابدأ بإضافة صورتك الترويجية الأولى

source: Tap to change image
ar: اضغط لتغيير الصورة

source: Title
ar: العنوان

# optionalTitleHint
source: Enter optional title
ar: أدخل العنوان (اختياري)

source: Subtitle
ar: العنوان الفرعي

# optionalSubtitleHint
source: Enter optional subtitle
ar: أدخل العنوان الفرعي (اختياري)

source: Save Changes
ar: حفظ التغييرات

source: Deactivate
ar: إلغاء التنشيط

source: Activate
ar: تنشيط

source: Explore our rich world
ar: استكشف عالمنا الغني

source: Pickup from Restaurant
ar: استلام من المطعم

source: Delivery Mode
ar: طريقة الاستلام

source: Delivery
ar: توصيل

source: Start New Order
ar: بدء طلب جديد

# clearCartConfirmation
source: You have items from another restaurant. Start a new order to clear the cart?
ar: لديك عناصر من مطعم آخر. هل تريد بدء طلب جديد ومسح السلة؟

source: New Order
ar: طلب جديد

# cancelAction
source: Cancel
ar: إلغاء

source: Report Issue
ar: الإبلاغ عن مشكلة

source: Subject
ar: الموضوع

source: Submit
ar: إرسال

source: Support Chat
ar: محادثة الدعم

# typeMessage
source: Type a message...
ar: اكتب رسالة...

# fieldRequired
source: Required
ar: مطلوب

# noMessages
source: No messages yet
ar: لا توجد رسائل بعد

source: Retry
ar: إعادة المحاولة

source: Management
ar: الإدارة

source: Catalog
ar: الكتالوج

source: Marketing
ar: التسويق

source: System
ar: النظام

source: Restaurant Categories
ar: فئات المطاعم

source: Articles
ar: المقالات

source: Pro Tip
ar: نصيحة

# proTipDescription
source: Use the menu (top-left) to access all management tools.
ar: استخدم القائمة (أعلى اليمين) للوصول إلى جميع أدوات الإدارة.

# selectOptionFromDrawer
source: Select an option from the drawer
ar: اختر خياراً من القائمة الجانبية

source: Join as Partner
ar: انضم كشريك

source: Start growing with Wassly
ar: ابدأ النمو مع وصلي

source: Full Name / Store Name
ar: الاسم الكامل / اسم المتجر

source: Business Documents
ar: وثائق العمل

# storeLogoOptional
source: Store Logo / Cover (Optional)
ar: شعار المتجر / الغلاف (اختياري)

source: Vehicle Info
ar: معلومات المركبة

source: Motorcycle
ar: دراجة نارية

source: Car
ar: سيارة

source: Bicycle
ar: دراجة

source: Sign Up as Partner
ar: تسجيل كشريك

# pleaseUploadAllDriverDocuments
source: Please upload all required driver documents
ar: يرجى تحميل جميع وثائق السائق المطلوبة

# pleaseUploadCommercialRegistration
source: Please upload commercial registration photo
ar: يرجى تحميل صورة السجل التجاري

source: Market registered successfully!
ar: تم تسجيل المتجر بنجاح!

# driverRegisteredWaitingApproval
source: Driver registered successfully! Please wait for admin approval.
ar: تم تسجيل السائق بنجاح! يرجى انتظار موافقة المسؤول.

source: Photo Attached
ar: تم إرفاق الصورة

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Driver Documents
ar: وثائق السائق

source: New Account
ar: حساب جديد

source: Join Wassly Now
ar: انضم إلى وصلي الآن

source: Discover Wassly
ar: اكتشف وصلي

# restaurantDashboardTitle
source: Restaurant Dashboard
ar: لوحة تحكم المطعم

# driverDashboardTitle
source: Driver Dashboard
ar: لوحة تحكم السائق

# marketDashboardTitle
source: Market Dashboard
ar: لوحة تحكم المتجر

source: Welcome, {name}!
ar: أهلاً بك، {name}!

# manageRestaurantSubtitle
source: Manage your restaurant orders and menu
ar: إدارة طلبات المطعـم والقائمـة

# manageMarketSubtitle
source: Monitor your sales and inventory
ar: إدارة مخزون المتجر والطلبات

source: Welcome to Restaurant Dashboard
ar: مرحباً بكم في لوحة تحكم المطعم

source: Welcome to Market Dashboard
ar: مرحباً بكم في لوحة تحكم المتجر

source: Quick Stats
ar: إحصائيات سريعة

source: View Orders
ar: عرض الطلبات

source: Restaurant Settings
ar: إعدادات المطعم

source: Market Settings
ar: إعدادات المتجر

source: My Restaurant
ar: مطعمي

source: My Market
ar: متجري

# myMarketLabel
source: My Market
ar: متجري

# newPartnerType
source: New {type}
ar: {type} جديد

source: Signup Address
ar: عنوان التسجيل

# continueText
source: Continue
ar: استمرار

source: Complete Setup
ar: إكمال الإعداد

source: Restaurant Image
ar: صورة المطعم

# contactAndLocation
source: Contact & Location
ar: الاتصال والموقع

source: Account Password
ar: كلمة مرور الحساب

# tellUsAboutRestaurant
source: Tell us about your restaurant
ar: أخبرنا عن مطعمك

# restaurantNameAsterisk
source: Restaurant Name *
ar: اسم المطعم *

# restaurantNameHint
source: e.g., Mario's Pizza
ar: مثال: ماريو بيتزا

# nameAtLeast3Chars
source: Name must be at least 3 characters
ar: يجب أن يكون الاسم 3 أحرف على الأقل

# descriptionAsterisk
source: Description *
ar: الوصف *

# descriptionHint
source: Describe your cuisine and specialties
ar: صف مأكولاتك وتخصصاتك

# descriptionRequired
source: Description is required
ar: الوصف مطلوب

# descriptionAtLeast10Chars
source: Description must be at least 10 characters
ar: يجب أن يكون الوصف 10 أحرف على الأقل

# whatCuisineDoYouServe
source: What type of cuisine do you serve?
ar: ما نوع المأكولات التي تقدمها؟

source: No categories selected
ar: لم يتم اختيار فئات

source: Select
ar: اختيار

# selectAtLeastOneCategoryHint
source: Select at least one category to help customers find your restaurant
ar: اختر فئة واحدة على الأقل لمساعدة العملاء في العثور على مطعمك

source: No categories available
ar: لا توجد فئات متاحة

# addBeautifulRestaurantImage
source: Add a beautiful image of your restaurant
ar: أضف صورة جميلة لمطعمك

# recommendedImageSize
source: Recommended: 1200x600px
ar: الموصى به: 1200x600 بكسل

source: Image selected
ar: تم اختيار الصورة

# howReachYou
source: How can customers reach you?
ar: كيف يمكن للعملاء الوصول إليك؟

# emailAddressAsterisk
source: Email Address *
ar: عنوان البريد الإلكتروني *

# phoneNumberAsterisk
source: Phone Number *
ar: رقم الهاتف *

# fullAddressAsterisk
source: Full Address *
ar: العنوان الكامل *

# addressHint
source: 123 Main St, City, State, ZIP
ar: 123 شارع النيل، القاهرة

# completeAddressRequired
source: Please enter a complete address
ar: يرجى إدخال عنوان كامل

# updateDetailsFromProfileHint
source: You can update these details anytime from your profile settings.
ar: يمكنك تحديث هذه التفاصيل في أي وقت من إعدادات ملفك الشخصي.

# createPasswordForRestaurant
source: Create a password for your restaurant account
ar: أنشئ كلمة مرور لحساب مطعمك

# passwordAsterisk
source: Password *
ar: كلمة المرور *

# passwordHint
source: Enter a secure password
ar: أدخل كلمة مرور آمنة

# confirmPasswordAsterisk
source: Confirm Password *
ar: تأكيد كلمة المرور *

# confirmPasswordHint
source: Confirm your password
ar: أكد كلمة المرور الخاصة بك

# passwordSecureHint
source: This password will be used to log into your restaurant account. Make sure to keep it secure.
ar: سيتم استخدام كلمة المرور هذه لتسجيل الدخول إلى حساب مطعمك. تأكد من الحفاظ على أمنها.

source: Image selected successfully
ar: تم اختيار الصورة بنجاح

source: My Products
ar: منتجاتي

source: Availability updated
ar: تم تحديث التوفر

source: Add First Product
ar: أضف المنتج الأول

# areYouSureDeleteProductWithName
source: Are you sure you want to delete "{name}"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "{name}"؟ لا يمكن التراجع عن هذا الإجراء.

source: Restaurant ID not found
ar: معرف المطعم غير موجود

source: Error
ar: خطأ

source: Invalid phone number
ar: رقم هاتف غير صالح

source: Refresh
ar: تحديث

source: Unknown Category
ar: تصنيف غير معروف

source: Delete
ar: حذف

# discountPercentageHint
source: e.g., 20 for 20%
ar: مثال: 20 لـ 20%

source: No start date
ar: لا يوجد تاريخ بدء

source: No end date
ar: لا يوجد تاريخ انتهاء

source: No tickets found
ar: لم يتم العثور على تذاكر

source: User not authenticated
ar: المستخدم غير مسجل

source: Not provided
ar: غير متوفر

source: Name
ar: الاسم

source: ONLINE
ar: متصل

source: OFFLINE
ar: غير متصل

source: Status updated
ar: تم تحديث الحالة

source: Deleted successfully
ar: تم الحذف بنجاح

source: Create Market
ar: إنشاء سوق

source: Discount ON
ar: الخصم نشط

source: Discount OFF
ar: الخصم غير نشط

source: No Markets Yet
ar: لا توجد متاجر بعد

source: No Restaurants Yet
ar: لا توجد مطاعم بعد

# startByCreatingFirstMarket
source: Start by creating your first market
ar: ابدأ بإنشاء متجرك الأول

# startByCreatingFirstRestaurant
source: Start by creating your first restaurant
ar: ابدأ بإنشاء مطعمك الأول

source: Delete Restaurant
ar: حذف المطعم

# deleteRestaurantConfirm
source: Are you sure you want to delete "{name}"? This action cannot be undone and will also delete all associated products.
ar: هل أنت متأكد من حذف "{name}"؟ لا يمكن التراجع عن هذا الإجراء وسيؤدي أيضاً لحذف جميع المنتجات المرتبطة.

# seedMarketsTitle
source: Seed Markets
ar: بذر الأسواق

# seedMarketsConfirm
source: This will create several default markets for testing. Continue?
ar: سيؤدي هذا إلى إنشاء عدة متاجر افتراضية للاختبار. هل تريد المتابعة؟

source: Seeding markets...
ar: جاري بذر الأسواق...

source: Markets seeded successfully!
ar: تم بذر الأسواق بنجاح!

# failedToSeedMarkets
source: Failed to seed markets: {error}
ar: فشل بذر الأسواق: {error}

source: Seed
ar: بذر

# searchHint
source: Search...
ar: بحث...

source: No results found
ar: لم يتم العثور على نتائج

# categoriesLabel
source: Categories: {categories}
ar: الفئات: {categories}

source: No categories
ar: لا توجد فئات

source: You are Online
ar: أنت متصل الآن

source: You are Offline
ar: أنت غير متصل

source: Waiting for orders...
ar: في انتظار الطلبات...

source: Go online to accept orders
ar: اتصل بالإنترنت لقبول الطلبات

source: Active Order
ar: الطلب النشط

source: Available Orders
ar: الطلبات المتاحة

source: Scanning area...
ar: جاري مسح المنطقة...

# noOrdersNearby
source: No orders nearby yet
ar: لا توجد طلبات قريبة بعد

source: Earnings
ar: الأرباح

source: Deliveries
ar: التوصيلات

source: History
ar: السجل

source: To Customer
ar: إلى العميل

source: To Restaurant
ar: إلى المطعم

source: Dropoff
ar: التسليم

source: Swipe to Complete
ar: اسحب للإكمال

source: Confirm Pickup
ar: تأكيد الاستلام

# orderAcceptedExclamation
source: Order Accepted!
ar: تم قبول الطلب!

source: Failed to accept order
ar: فشل في قبول الطلب

# orderDeliveredSuccessfully
source: Order Delivered! Great job.
ar: تم توصيل الطلب! عمل رائع.

source: Failed to update status
ar: فشل في تحديث الحالة

source: No reviews yet
ar: لا توجد تقييمات بعد

source: Product not found
ar: المنتج غير موجود

source: Loading restaurant data...
ar: جاري تحميل بيانات المطعم...

source: Page Not Found
ar: الصفحة غير موجودة

source: Go to Home
ar: الذهاب للرئيسية

source: Please login
ar: يرجى تسجيل الدخول

source: Error Screen
ar: شاشة خطأ

source: Add Article
ar: إضافة مقال

source: Edit Article
ar: تعديل المقال

# articleCreated
source: Article created successfully
ar: تم إنشاء المقال بنجاح

source: Failed to upload image
ar: فشل في رفع الصورة

# errorOccurred
source: An error occurred: {error}
ar: حدث خطأ: {error}

source: No drivers yet
ar: لا يوجد سائقون بعد

source: Tap to add image
ar: اضغط لإضافة صورة

# titleLabel
source: Title *
ar: العنوان *

# titleHint
source: Enter title
ar: أدخل العنوان

# titleRequired
source: Title is required
ar: العنوان مطلوب

# contentLabel
source: Content *
ar: المحتوى *

# contentHint
source: Enter content
ar: أدخل المحتوى

# contentRequired
source: Content is required
ar: المحتوى مطلوب

# authorLabel
source: Author
ar: الكاتب

# authorHint
source: Enter author name
ar: أدخل اسم الكاتب

source: Publish Article
ar: نشر المقال

# articleVisible
source: Article will be visible to users
ar: سيكون المقال مرئياً للمستخدمين

# articleSavedAsDraft
source: Article will be saved as draft
ar: سيتم حفظ المقال كمسودة

source: Save Article
ar: حفظ المقال

source: User Management
ar: إدارة المستخدمين

source: Driver Management
ar: إدارة السائقين

# searchUsersHint
source: Search users...
ar: البحث عن مستخدمين...

# searchDriversHint
source: Search drivers...
ar: البحث عن سائقين...

# searchOrdersHint
source: Search orders...
ar: البحث عن طلبات...

source: No users found
ar: لم يتم العثور على مستخدمين

source: No drivers found
ar: لم يتم العثور على سائقين

source: Add Driver
ar: إضافة سائق

source: Add First Driver
ar: إضافة أول سائق

source: Driver deleted successfully
ar: تم حذف السائق بنجاح

source: Seed Markets
ar: بذر الأسواق

source: Restaurant Management
ar: إدارة المطاعم

source: Reviews
ar: التقييمات

source: Order #{number}
ar: طلب رقم {number}

source: Order Management
ar: إدارة الطلبات

source: Edit Driver
ar: تعديل السائق

source: Delete Driver
ar: حذف السائق

source: Driver not found
ar: لم يتم العثور على السائق

source: No recent orders
ar: لا توجد طلبات حديثة

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: App Version
ar: إصدار التطبيق

source: Total Revenue
ar: إجمالي الإيرادات

source: Recent Activity
ar: النشاط الأخير

source: Recent Orders
ar: الطلبات الأخيرة

source: App Settings
ar: إعدادات التطبيق

source: About
ar: حول

source: Admin Panel
ar: لوحة المسؤول

# adminPanelSubtitle
source: Full access without authentication
ar: وصول كامل بدون مصادقة

source: Help & Support
ar: المساعدة والدعم

source: Market Category
ar: فئة السوق

source: Market Name
ar: اسم السوق

source: Tap to upload market image
ar: اضغط لرفع صورة السوق

source: Creating Market...
ar: جاري إنشاء السوق...

source: Market created successfully
ar: تم إنشاء السوق بنجاح

# provideCredentialsToMarket
source: Please provide these credentials to the market owner:
ar: يرجى تزويد مالك السوق ببيانات الاعتماد هذه:

# marketCanChangePasswordAfterLogin
source: The market owner can change their password after logging in.
ar: يمكن لمالك السوق تغيير كلمة المرور بعد تسجيل الدخول.

# areYouSureDeleteCategoryGeneric
source: Are you sure you want to delete this category?
ar: هل أنت متأكد من حذف هذه الفئة؟

# totalAmountLabel
source: Total: {amount}
ar: الإجمالي: {amount}

source: Pick Up
ar: استلام

source: Mark Delivered
ar: إتمام التوصيل

# orderPickedUpSuccess
source: Order picked up
ar: تم استلام الطلب

# orderDeliveredSuccess
source: Order delivered
ar: تم توصيل الطلب

source: Delete Article
ar: حذف المقال

source: Update Article
ar: تحديث المقال

source: Driver account status
ar: حالة حساب السائق

source: Driver updated successfully
ar: تم تحديث السائق بنجاح

# tapToUpload
source: Tap to upload {label}
ar: اضغط لرفع {label}

source: Restaurant account status
ar: حالة حساب المطعم

# emailLabel
source: Email:
ar: البريد الإلكتروني:

# passwordLabel
source: Password:
ar: كلمة المرور:

# selectProductToLink
source: Select a product to link
ar: اختر منتجاً لربطه

source: No linked product
ar: لا يوجد منتج مرتبط

source: Discount Image
ar: صورة الخصم

source: Linked Product
ar: المنتج المرتبط

source: Tap to upload discount image
ar: اضغط لرفع صورة الخصم

source: Unknown
ar: غير معروف

source: Picked Up
ar: تم الاستلام

source: Customer
ar: عميل

# displayOrderHelper
source: Lower numbers appear first
ar: الأرقام الأقل تظهر أولاً

source: Please enter order
ar: الرجاء إدخال الترتيب

# pleaseEnterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صحيح

# adminRole
source: Administrator
ar: مدير النظام

# restaurantRole
source: Restaurant
ar: مطعم

# driverRole
source: Driver
ar: سائق

# customerRole
source: Customer
ar: عميل

# areYouSureDeleteDriver
source: Are you sure you want to delete this driver?
ar: هل أنت متأكد من حذف هذا السائق؟

# statusLabel
source: Status
ar: الحالة

source: Update Driver
ar: تحديث السائق

# takeBreakOrGoOnline
source: Take a break or go online to start earning
ar: خذ قسطاً من الراحة أو اذهب للنشاط للبدء في كسب المال

# estEarnings
source: Est. Earnings: {amount} {currency}
ar: الأرباح المتوقعة: {amount} {currency}
