Repository: ahmed-shorbagy/wassly
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Create Restaurant
ar: إنشاء مطعم

source: Restaurant Setup
ar: إعداد المطعم

source: Basic Information
ar: المعلومات الأساسية

source: Restaurant Name
ar: اسم المطعم

source: Description
ar: الوصف

source: Please enter restaurant name
ar: الرجاء إدخال اسم المطعم

source: Please enter description
ar: الرجاء إدخال الوصف

source: Contact Information
ar: معلومات الاتصال

source: Phone Number
ar: رقم الهاتف

source: Email
ar: البريد الإلكتروني

source: Commercial Registration
ar: السجل التجاري

source: Optional
ar: اختياري

source: Please enter phone number
ar: الرجاء إدخال رقم الهاتف

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
ar: الرجاء إدخال رقم هاتف صحيح

source: Please enter email
ar: الرجاء إدخال البريد الإلكتروني

# pleaseEnterValidEmail
source: Please enter a valid email
ar: الرجاء إدخال بريد إلكتروني صحيح

source: Location
ar: الموقع

source: Address
ar: العنوان

source: Please enter address
ar: الرجاء إدخال العنوان

source: Tap to select location on map
ar: اضغط لاختيار الموقع على الخريطة

# locationSet
source: Location: {latitude}, {longitude}
ar: الموقع: {latitude}, {longitude}

# locationSetToCairo
source: Location set to Cairo, Egypt
ar: تم تعيين الموقع إلى القاهرة، مصر

source: Categories
ar: الفئات

source: Select Categories
ar: اختر الفئات

source: Tap to select categories
ar: اضغط لاختيار الفئات

source: Selected Categories:
ar: الفئات المختارة:

source: Done
ar: تم

source: Edit
ar: تعديل

source: Delivery Settings
ar: إعدادات التوصيل

source: Delivery Fee
ar: رسوم التوصيل (ريال)

source: Min Order ($)
ar: الحد الأدنى للطلب (ريال)

# estimatedDeliveryTime
source: Estimated Delivery Time (minutes)
ar: وقت التوصيل المتوقع (دقيقة)

source: Required
ar: مطلوب

source: Invalid number
ar: رقم غير صحيح

source: Tap to upload restaurant image
ar: اضغط لتحميل صورة المطعم

source: Change
ar: تغيير

# pleaseSelectImage
source: Please select a restaurant image
ar: الرجاء اختيار صورة المطعم

# pleaseSelectLocation
source: Please select a location
ar: الرجاء اختيار الموقع

source: Please select at least one category
ar: الرجاء اختيار فئة واحدة على الأقل

# creatingRestaurant
source: Creating your restaurant...
ar: جاري إنشاء المطعم...

source: Restaurant created successfully
ar: تم إنشاء المطعم بنجاح

# provideCredentialsToRestaurant
source: Please provide these credentials to the restaurant:
ar: يرجى تزويد المطعم ببيانات الاعتماد هذه:

# restaurantCanChangePasswordAfterLogin
source: The restaurant can change their password after their first login.
ar: يمكن للمطعم تغيير كلمة المرور بعد تسجيل الدخول لأول مرة.

# failedToPickImage
source: Failed to pick image: {error}
ar: فشل في اختيار الصورة: {error}

source: Fast Food
ar: وجبات سريعة

source: Italian
ar: إيطالي

source: Chinese
ar: صيني

source: Indian
ar: هندي

source: Mexican
ar: مكسيكي

source: Japanese
ar: ياباني

source: Thai
ar: تايلندي

source: Mediterranean
ar: بحر متوسطي

source: American
ar: أمريكي

source: Vegetarian
ar: نباتي

source: Vegan
ar: نباتي صرف

source: Desserts
ar: حلويات

source: Beverages
ar: مشروبات

source: Healthy
ar: صحي

source: BBQ
ar: مشاوي

source: Seafood
ar: مأكولات بحرية

source: Arabic
ar: عربي

source: Egyptian
ar: مصري

source: Lebanese
ar: لبناني

source: Syrian
ar: سوري

source: Palestinian
ar: فلسطيني

source: Jordanian
ar: أردني

source: Saudi
ar: سعودي

source: Emirati
ar: إماراتي

source: Gulf
ar: خليجي

source: Moroccan
ar: مغربي

source: Tunisian
ar: تونسي

source: Algerian
ar: جزائري

source: Yemeni
ar: يمني

source: Iraqi
ar: عراقي

source: Grilled Meat
ar: لحوم مشوية

source: Kebabs
ar: كباب

source: Shawarma
ar: شاورما

source: Falafel
ar: فلافل

source: Hummus
ar: حمص

source: Mezze
ar: مقبلات

source: Foul
ar: فول

source: Taameya
ar: طعمية

source: Koshary
ar: كشري

source: Mansaf
ar: منسف

source: Mansi
ar: منسي

source: Mandi
ar: مندي

source: Kabsa
ar: كبسة

source: Majboos
ar: مجبوس

source: Maqluba
ar: مقلوبة

source: Musakhan
ar: مسخن

source: Mansaf Jordanian
ar: منسف أردني

source: Waraq Enab
ar: ورق عنب

source: Mahshi
ar: محشي

source: Kofta
ar: كفتة

source: Samosa
ar: سمبوسة

source: Knafeh
ar: كنافة

source: Baklava
ar: بقلاوة

source: Biryani
ar: بيرياني

source: Baked Goods
ar: مخبوزات

source: Oriental Sweets
ar: حلويات شرقية

source: Commercial Registration Photo
ar: صورة السجل التجاري

source: Take Photo
ar: التقاط صورة

source: Open Camera
ar: فتح الكاميرا

source: Please take commercial registration photo
ar: الرجاء التقاط صورة السجل التجاري

source: Product Management
ar: إدارة المنتجات

source: Products
ar: المنتجات

source: Add Product
ar: إضافة منتج

source: Edit Product
ar: تعديل منتج

source: Product Name
ar: اسم المنتج

source: Product Description
ar: وصف المنتج

source: Product Price
ar: سعر المنتج

source: Product Category
ar: فئة المنتج

source: Product Image
ar: صورة المنتج

# productAvailable
source: Available
ar: متوفر

# productUnavailable
source: Unavailable
ar: غير متوفر

source: Please enter product name
ar: الرجاء إدخال اسم المنتج

source: Please enter product description
ar: الرجاء إدخال وصف المنتج

source: Please enter product price
ar: الرجاء إدخال سعر المنتج

source: Please select product category
ar: الرجاء اختيار فئة المنتج

source: Please select product image
ar: الرجاء اختيار صورة المنتج

source: Product added successfully
ar: تم إضافة المنتج بنجاح

source: Product updated successfully
ar: تم تحديث المنتج بنجاح

source: Product deleted successfully
ar: تم حذف المنتج بنجاح

source: Creating product...
ar: جاري إضافة المنتج...

source: Updating product...
ar: جاري تحديث المنتج...

source: Deleting product...
ar: جاري حذف المنتج...

# areYouSureDeleteProduct
source: Are you sure you want to delete this product?
ar: هل أنت متأكد من حذف هذا المنتج؟

source: No products yet
ar: لا توجد منتجات حتى الآن

source: Start by adding your first product
ar: ابدأ بإضافة منتجك الأول

# selectRestaurantFirst
source: Please select a restaurant first
ar: الرجاء اختيار مطعم أولاً

source: Restaurant Products
ar: منتجات المطعم

source: Password
ar: كلمة المرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: Please enter password
ar: الرجاء إدخال كلمة المرور

source: Please confirm password
ar: الرجاء تأكيد كلمة المرور

source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Update Password
ar: تحديث كلمة المرور

source: Password updated successfully
ar: تم تحديث كلمة المرور بنجاح

source: New Password
ar: كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Current Password
ar: كلمة المرور الحالية

source: Edit Restaurant
ar: تعديل المطعم

source: Restaurant Information
ar: معلومات المطعم

source: Restaurant Status
ar: حالة المطعم

source: Restaurant is open
ar: المطعم مفتوح

source: Restaurant is closed
ar: المطعم مغلق

source: Manage Products
ar: إدارة المنتجات

source: Update Restaurant
ar: تحديث المطعم

source: Restaurant updated successfully
ar: تم تحديث المطعم بنجاح

source: Updating restaurant...
ar: جاري تحديث المطعم...

source: Restaurant not found
ar: لم يتم العثور على المطعم

source: Back
ar: رجوع

source: Loading...
ar: جاري التحميل...

# leavePasswordEmptyToKeepCurrent
source: Leave password empty to keep current password
ar: اترك كلمة المرور فارغة للاحتفاظ بالكلمة الحالية

source: Cart
ar: السلة

# cartEmpty
source: Cart is empty
ar: السلة فارغة

source: Browse Restaurants
ar: تصفح المطاعم

source: Total
ar: المجموع

source: Proceed to Checkout
ar: إتمام الطلب

# navHome
source: Home
ar: الرئيسية

# navOrders
source: My Orders
ar: طلباتي

# navProfile
source: My Profile
ar: حسابي

# navPay
source: Pay
ar: الدفع

source: Remove
ar: حذف

source: Quantity
ar: الكمية

# itemAddedToCart
source: {productName} added to cart
ar: تم إضافة {productName} إلى السلة

# cannotAddDifferentRestaurant
source: Cannot add products from different restaurants. Please clear cart first.
ar: لا يمكن إضافة منتجات من مطاعم مختلفة. يرجى إفراغ السلة أولاً.

source: Clear Cart
ar: إفراغ السلة

# areYouSureClearCart
source: Are you sure you want to clear the cart?
ar: هل أنت متأكد من إفراغ السلة؟

source: Subtotal
ar: المجموع الفرعي

source: Tax
ar: الضريبة

source: Grand Total
ar: المجموع الكلي

source: Restaurants
ar: المطاعم

source: Markets
ar: المتاجر

# restaurantsAndMarkets
source: Restaurants & Markets
ar: المطاعم والماركت

source: Search restaurants...
ar: ابحث عن مطعم...

source: Nearby Restaurants
ar: مطاعم قريبة منك

source: View All
ar: عرض الكل

# specialOffers
source: Exclusive Deals
ar: عروض خاصة

source: No Restaurants
ar: لا توجد مطاعم

# noRestaurantsAvailable
source: No restaurants available at the moment
ar: لا توجد مطاعم متاحة حالياً

# noRestaurantsAvailableMessage
source: Check back later for new restaurants
ar: تحقق لاحقاً للحصول على مطاعم جديدة

source: No restaurants found
ar: لم يتم العثور على مطاعم

# tryDifferentSearchTerm
source: Try a different search term
ar: جرب مصطلح بحث مختلف

source: Exit App
ar: الخروج

# exitAppConfirmation
source: Are you sure you want to exit the app?
ar: هل أنت متأكد من الخروج من التطبيق؟

source: Cancel
ar: إلغاء

source: Exit
ar: خروج

source: Unsaved Changes
ar: تغييرات غير محفوظة

# unsavedChangesWarning
source: You have unsaved changes. Do you want to discard them and continue?
ar: لديك تغييرات غير محفوظة. هل تريد تجاهلها والمتابعة؟

source: Discard
ar: تجاهل

source: Restaurant Orders
ar: طلبات المطعم

source: Pending Orders
ar: الطلبات المعلقة

source: Active Orders
ar: الطلبات النشطة

source: Order History
ar: سجل الطلبات

source: All Orders
ar: جميع الطلبات

source: No orders yet
ar: لا توجد طلبات حتى الآن

source: No Pending Orders
ar: لا توجد طلبات معلقة

# noPendingOrdersMessage
source: No pending orders at the moment
ar: لا توجد طلبات معلقة حالياً

source: No Active Orders
ar: لا توجد طلبات نشطة

# noActiveOrdersMessage
source: No active orders at the moment
ar: لا توجد طلبات نشطة حالياً

source: No Order History
ar: لا يوجد سجل طلبات

# noOrderHistoryMessage
source: Your order history is empty
ar: سجل الطلبات الخاص بك فارغ

source: Order ID
ar: رقم الطلب

source: Order Items
ar: عناصر الطلب

# moreItems
source: + {count} more items
ar: + {count} عناصر أخرى

source: Pending
ar: قيد الانتظار

source: Accepted
ar: مقبول

source: Preparing
ar: جاري التحضير

source: Ready
ar: جاهز

source: On the Way
ar: في الطريق

source: Delivered
ar: تم التوصيل

source: Cancelled
ar: ملغى

# orderPending
source: Pending
ar: معلق

# orderPreparing
source: Preparing
ar: قيد التحضير

# orderReady
source: Ready
ar: جاهز

# orderPickedUp
source: On the Way
ar: في الطريق

# orderDelivered
source: Delivered
ar: تم التسليم

# orderCancelled
source: Cancelled
ar: ملغي

source: Order Placed
ar: تم تقديم الطلب

source: Reject
ar: رفض

source: Accept
ar: قبول

source: Start Preparing
ar: بدء التحضير

source: Mark as Ready
ar: تحديد كجاهز

source: Waiting for Driver
ar: في انتظار السائق

source: Order accepted
ar: تم قبول الطلب

source: Reject Order
ar: رفض الطلب

# rejectOrderConfirmation
source: Are you sure you want to reject this order?
ar: هل أنت متأكد من رفض هذا الطلب؟

source: Order rejected
ar: تم رفض الطلب

source: Order status updated
ar: تم تحديث حالة الطلب

source: Market Products
ar: منتجات الماركت

source: No Market Products
ar: لا توجد منتجات سوق

source: Start by adding your first market product
ar: ابدأ بإضافة منتج الماركت الأول

source: Search products...
ar: ابحث عن المنتجات...

source: Delete Product
ar: حذف المنتج

source: No products found
ar: لم يتم العثور على منتجات

source: Startup Ads
ar: إعلانات البداية

source: Banner Ads
ar: إعلانات البانر

source: Add Ad
ar: إضافة إعلان

source: Add Startup Ad
ar: إضافة إعلان بداية

source: Add Banner
ar: إضافة بانر

source: Edit Startup Ad
ar: تعديل إعلان البداية

source: Edit Banner
ar: تعديل البانر

source: Update Ad
ar: تحديث الإعلان

source: Update Banner
ar: تحديث البانر

source: Ad Title
ar: عنوان الإعلان

source: Ad Description
ar: وصف الإعلان

source: Deep Link
ar: رابط عميق

source: Priority
ar: الأولوية

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: Ad added successfully
ar: تم إضافة الإعلان بنجاح

source: Ad updated successfully
ar: تم تحديث الإعلان بنجاح

source: Ad deleted successfully
ar: تم حذف الإعلان بنجاح

source: Creating ad...
ar: جاري إنشاء الإعلان...

source: Updating ad...
ar: جاري تحديث الإعلان...

source: Delete Ad
ar: حذف الإعلان

source: Delete Banner
ar: حذف البانر

# areYouSureDeleteAd
source: Are you sure you want to delete
ar: هل أنت متأكد من حذف

# areYouSureDeleteBanner
source: Are you sure you want to delete
ar: هل أنت متأكد من حذف

source: ad
ar: الإعلان

source: banner
ar: البانر

source: No Startup Ads
ar: لا توجد إعلانات بداية

source: No Banner Ads
ar: لا توجد إعلانات بانر

source: Start by adding your first startup ad
ar: ابدأ بإضافة إعلان البداية الأول

source: Start by adding your first banner ad
ar: ابدأ بإضافة إعلان البانر الأول

source: Admin Dashboard
ar: لوحة التحكم

source: Welcome Back
ar: مرحباً بعودتك

source: Admin Access
ar: وصول المدير

# adminAccessDescription
source: You have full administrative access to all platform features. No authentication required.
ar: لديك وصول كامل لإدارة جميع ميزات المنصة. لا يتطلب المصادقة.

# totalRestaurants
source: Restaurants
ar: المطاعم

# totalOrders
source: Orders
ar: الطلبات

# totalUsers
source: Users
ar: المستخدمين

source: Quick Actions
ar: إجراءات سريعة

source: Drivers
ar: السائقين

source: Users
ar: المستخدمين

source: Analytics
ar: التحليلات

source: Orders
ar: الطلبات

source: Settings
ar: الإعدادات

source: OK
ar: موافق

source: Info
ar: معلومات

source: All
ar: الكل

source: minutes
ar: دقيقة

source: Free
ar: مجاني

source: View Cart
ar: عرض السلة

# addProductsWorth
source: Add products worth {amount} to start the order
ar: أضف منتجات بقيمة {amount} لتبدأ الطلب

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

# enterEmailForPasswordReset
source: Enter your email to receive a password reset link
ar: أدخل بريدك الإلكتروني لإرسال رابط إعادة تعيين كلمة المرور

# passwordResetEmailSent
source: Password reset link has been sent to your email
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني

source: Send
ar: إرسال

source: Cannot open phone app
ar: لا يمكن فتح تطبيق الهاتف

# errorCalling
source: Error occurred while calling
ar: حدث خطأ أثناء الاتصال

source: Calling
ar: جاري الاتصال

source: Order placed successfully
ar: تم تقديم الطلب بنجاح

# pleaseLoginToPlaceOrder
source: Please log in to place an order
ar: يرجى تسجيل الدخول لتقديم الطلب

# addressRequired
source: Address is required
ar: العنوان مطلوب

# phoneNumberRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

source: Delivery Address
ar: عنوان التوصيل

# enterDeliveryAddress
source: Enter your delivery address
ar: أدخل عنوان التوصيل

# enterPhoneNumber
source: Enter your phone number
ar: أدخل رقم الهاتف

# orderNotes
source: Order Notes (Optional)
ar: ملاحظات الطلب (اختياري)

source: Notes
ar: ملاحظات

source: Any special instructions?
ar: أي تعليمات خاصة؟

source: Order Summary
ar: ملخص الطلب

source: Place Order
ar: تقديم الطلب

source: Cart is empty
ar: السلة فارغة

source: Start adding products from restaurants
ar: ابدأ بإضافة منتجات من المطاعم

source: Please log in
ar: يرجى تسجيل الدخول

source: No orders found
ar: لم يتم العثور على طلبات

source: Loading order...
ar: جاري تحميل الطلب...

source: Cancel Order
ar: إلغاء الطلب

# areYouSureCancelOrder
source: Are you sure you want to cancel this order?
ar: هل أنت متأكد من إلغاء هذا الطلب؟

source: Yes, Cancel
ar: نعم، إلغاء

source: No
ar: لا

source: Order cancelled successfully
ar: تم إلغاء الطلب بنجاح

source: Restaurant
ar: المطعم

source: Order Time
ar: وقت الطلب

source: Total Amount
ar: المجموع الكلي

source: Driver Information
ar: معلومات السائق

source: Driver
ar: السائق

source: Social login coming soon
ar: تسجيل الدخول عبر وسائل التواصل الاجتماعي قريباً

# marketProductAddedToCart
source: {productName} added to cart
ar: تم إضافة {productName} إلى السلة

source: Failed to add product to cart
ar: فشل إضافة المنتج إلى السلة

source: Market products ordering coming soon
ar: طلب منتجات الماركت قريباً

source: My Orders
ar: طلباتي

source: View Details
ar: عرض التفاصيل

source: Checkout
ar: الدفع

# placingOrder
source: Placing your order...
ar: جاري تقديم الطلب...

source: Order Details
ar: تفاصيل الطلب

source: Delivery Information
ar: معلومات التوصيل

source: Favorites
ar: المفضلة

source: No favorites yet
ar: لا توجد عناصر مفضلة بعد

source: Profile
ar: الملف الشخصي

source: My Profile
ar: ملفي الشخصي

source: Personal Information
ar: المعلومات الشخصية

source: Full Name
ar: الاسم الكامل

source: Phone
ar: الهاتف

source: Logout
ar: تسجيل الخروج

# areYouSureLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Account Information
ar: معلومات الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Update Profile
ar: تحديث الملف الشخصي

source: Login
ar: تسجيل الدخول

source: Welcome
ar: أهلاً بك

source: Log in to continue
ar: سجّل دخولك للمتابعة

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: or
ar: أو

source: Food Categories
ar: فئات الطعام

source: Add Category
ar: إضافة فئة

source: Edit Category
ar: تعديل الفئة

source: Update Category
ar: تحديث فئة

source: Delete Category
ar: حذف الفئة

source: Category Name
ar: اسم الفئة

source: Please enter category name
ar: الرجاء إدخال اسم الفئة

source: No categories found
ar: لم يتم العثور على فئات

source: Category created successfully
ar: تم إنشاء الفئة بنجاح

source: Category updated successfully
ar: تم تحديث الفئة بنجاح

source: Category not found
ar: الفئة غير موجودة

source: Creating category...
ar: جاري إنشاء الفئة...

source: Updating category...
ar: جاري تحديث الفئة...

# areYouSureDeleteCategory
source: Are you sure you want to delete the category "{name}"?
ar: هل أنت متأكد من حذف الفئة "{name}"؟

source: Display Order
ar: ترتيب العرض

# currency
source: EGP
ar: جنيه مصري

source: Open
ar: مفتوح

source: Closed
ar: مغلق

source: Groceries
ar: البقالة

# healthAndBeauty
source: Health & Beauty
ar: الصحة والجمال

source: Pickup
ar: الاستلام

source: Free Delivery
ar: توصيل مجاني

# orderNowForDeliveryToday
source: Order now for your order to arrive today at 10:00
ar: اطلب الآن ليصل طلبك اليوم عند الساعة ١٠:٠٠

source: Schedule
ar: جدولة

source: Sort By
ar: رتب حسب

# relevance
source: Most Relevant
ar: الأكثر صلة

source: Highest Rating
ar: الأعلى تقييماً

source: Fastest Delivery
ar: أسرع توصيل

source: Lowest Price
ar: الأقل سعراً

source: Select Delivery Address
ar: حدد عنوان التوصيل

# defaultAddress
source: Default
ar: افتراضي

source: Failed to load restaurant data
ar: فشل تحميل بيانات المطعم

source: Burger
ar: برجر

source: Pizza
ar: بيتزا

source: Noodles
ar: نودلز

source: Meat
ar: لحوم

source: min
ar: د

# minutesAbbreviation
source: min
ar: د

source: Please login to continue
ar: يرجى تسجيل الدخول للمتابعة

# invalidProduct
source: Invalid product. Please try again.
ar: منتج غير صالح. يرجى المحاولة مرة أخرى.

source: Quantity must be greater than zero
ar: يجب أن تكون الكمية أكبر من الصفر

# failedToAddItemToCart
source: Failed to add item to cart. Please try again.
ar: فشل إضافة المنتج إلى السلة. يرجى المحاولة مرة أخرى.

# productAddedToCart
source: {productName} added to cart
ar: تم إضافة {productName} إلى السلة

source: items
ar: عناصر

source: N/A
ar: غير متاح

source: Creating driver...
ar: جاري إنشاء السائق...

source: Personal Photo
ar: الصورة الشخصية

source: Please enter full name
ar: يرجى إدخال الاسم الكامل

source: OFF
ar: خصم

source: Special Offer
ar: عرض خاص

source: Discount
ar: الخصم

source: Discount Percentage
ar: نسبة الخصم

source: Discount Description
ar: وصف الخصم

source: Discount Start Date
ar: تاريخ بداية الخصم

source: Discount End Date
ar: تاريخ نهاية الخصم

source: Enable Discount
ar: تفعيل الخصم

source: Disable Discount
ar: تعطيل الخصم

source: Active Discount
ar: خصم نشط

source: Discount updated successfully
ar: تم تحديث الخصم بنجاح

source: updated successfully
ar: تم التحديث بنجاح

source: Save
ar: حفظ

source: Please enter delivery fee
ar: يرجى إدخال رسوم التوصيل

source: Please enter minimum order amount
ar: يرجى إدخال الحد الأدنى لمبلغ الطلب

source: Please enter delivery time
ar: يرجى إدخال وقت التوصيل

source: Create Driver
ar: إنشاء سائق

source: Please select personal image
ar: يرجى اختيار الصورة الشخصية

source: Please select driver license
ar: يرجى اختيار رخصة القيادة

source: Please select vehicle license
ar: يرجى اختيار رخصة المركبة

source: Please select vehicle photo
ar: يرجى اختيار صورة المركبة

source: License Information
ar: معلومات الرخصة

source: Vehicle Information
ar: معلومات المركبة

source: Vehicle Type
ar: نوع المركبة

source: Please select vehicle type
ar: يرجى اختيار نوع المركبة

source: Vehicle Model
ar: موديل المركبة

source: Please enter vehicle model
ar: يرجى إدخال موديل المركبة

source: Vehicle Color
ar: لون المركبة

source: Please enter vehicle color
ar: يرجى إدخال لون المركبة

source: Vehicle Plate Number
ar: رقم لوحة المركبة

source: Please enter vehicle plate number
ar: يرجى إدخال رقم لوحة المركبة

source: Driver License
ar: رخصة القيادة

source: Vehicle License
ar: رخصة المركبة

source: Vehicle Photo
ar: صورة المركبة

source: Select Image Source
ar: اختر مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

source: Driver Created Successfully
ar: تم إنشاء السائق بنجاح

# pleaseProvideTheseCredentials
source: Please provide these credentials to the driver:
ar: يرجى توفير هذه البيانات للسائق:

# noteDriverCanChangePassword
source: Note: Driver can change password after first login.
ar: ملاحظة: يمكن للسائق تغيير كلمة المرور بعد أول تسجيل دخول.

source: Tap to upload image
ar: اضغط لرفع الصورة

# marketProductCategories
source: Market Categories
ar: فئات الماركت

source: Market
ar: الماركت

source: Vegetables
ar: خضروات

source: Fruits
ar: فواكه

source: Snacks
ar: وجبات خفيفة

source: Dairy
ar: ألبان

source: Bakery
ar: مخبوزات

source: Frozen
ar: مجمدة

source: Canned
ar: معلبات

source: Spices
ar: بهارات

source: Cleaning
ar: منظفات

source: Personal Care
ar: العناية الشخصية

source: Fish
ar: أسماك

source: Dairy Products
ar: ألبان

source: Cheese
ar: جبن

source: Eggs
ar: بيض

source: Soft Drinks
ar: مشروبات غازية

source: Water
ar: مياه

source: Juices
ar: عصائر

source: Pasta and Rice
ar: مكرونات و أرز

source: Chips and Snacks
ar: شيبسي

source: Top Categories
ar: الفئات الرئيسية

# pleaseSelectCategory
source: Please select a category
ar: الرجاء اختيار فئة

source: Address Book
ar: سجل العناوين

source: Add Address
ar: إضافة عنوان

source: No addresses found
ar: لا توجد عناوين

# addYourFirstAddress
source: Add your first address to get started
ar: أضف عنوانك الأول للبدء

source: Delete Address
ar: حذف العنوان

# deleteAddressConfirm
source: Are you sure you want to delete this address?
ar: هل أنت متأكد من حذف هذا العنوان؟

source: Offers
ar: عروض

source: Fruits & Vegetables
ar: الفواكه والخضروات

source: Poultry, Meat & Seafood
ar: دواجن، لحوم ومأكولات بحرية

source: Fresh Food
ar: أطعمة طازجة

source: Ready to Eat
ar: جاهز للأكل

source: Frozen Food
ar: الأطعمة المجمدة

# dairyAndEggs
source: Dairy & Eggs
ar: منتجات الألبان والبيض

source: Ice Cream
ar: آيس كريم

source: Milk
ar: حليب

source: Beauty
ar: الجمال

# cookingAndBaking
source: Cooking & Baking
ar: الطهي والخبز

# coffeeAndTea
source: Coffee & Tea
ar: القهوة والشاي

# pharmacy
source: Pharmacies
ar: الصيدليات

# cakeAndCoffee
source: Cake & Coffee
ar: الكيك والقهوة

# vegetablesAndFruits
source: Vegetables & Fruits
ar: الخضروات والفواكه

# tissuesAndBags
source: Tissues & Bags
ar: مناديل و اكياس

source: Canned Food
ar: معلبات

source: Breakfast Food
ar: طعام الإفطار

source: Baby Corner
ar: ركن الأطفال
